tap "romkatv/powerlevel10k"
tap "microsoft/git"

brew "tldr"
brew "fd"
brew "mkcert"

brew "nvm"
brew "git"
brew "wget"
brew "jenv"
brew "yarn"
brew "go"
brew "docker-compose"
brew "kubectx"
brew "postgresql"
brew "openjdk@11"
brew "openjdk@17"

brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "docker"
cask "iterm2"
cask "textmate"
cask "jetbrains-toolbox"
cask "postman"
cask "google-cloud-sdk"
cask "git-credential-manager-core"

cask "google-chrome"
cask "firefox"

cask "keepassx"
cask "ledger-live"

cask "vlc"
cask "zoom"
cask "spotify"
cask "slack"
cask "whatsapp"
cask "telegram"

cask "google-drive"
cask "android-file-transfer"