brew "tldr"
brew "fd"
brew "mkcert"

brew "zsh"
brew "nvim"
brew "jq"
brew "stern"
brew "nvm"
brew "git"
brew "wget"
brew "jenv"
brew "yarn"
brew "go"
brew "docker-compose"
brew "kubectx"
brew "postgresql@15"
brew "openjdk@21"

brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "docker"
cask "iterm2"
cask "wezterm"
cask "textmate"
cask "jetbrains-toolbox"
cask "postman"
cask "google-cloud-sdk"
cask "git-credential-manager-core"

cask "google-chrome"
cask "firefox"

cask "keepassx"
cask "ledger-live"

cask "vlc"
cask "zoom"
cask "slack"
cask "whatsapp"
cask "telegram"

cask "google-drive"
cask "macdroid"